app/controllers/communities_controller.rb

  def index
    @communities = Community.all
---
SELECT "communities".* FROM "communities"

  def show
@posts = @community.posts
@subscriber_count = @community.subscribers.count
@is_subscribed = acc_signed_in? ? Subscription.where(community_id: @community.id, acc_id: current_acc.id).any? : false
---
SELECT "posts".* FROM "posts" WHERE "posts"."community_id" = $1  [["community_id", 2]]
SELECT  1 AS one FROM "subscriptions" WHERE "subscriptions"."community_id" = $1 AND "subscriptions"."acc_id" = $2 LIMIT $3  [["community_id", 1], ["acc_id", 1], ["LIMIT", 1]]

  def create
    @community = Community.new community_values
    @community.acc_id = current_acc.id

    if  @community.save
---
INSERT INTO "communities" ("acc_id", "name", "url", "rules", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["acc_id", 1], ["name", "dino"], ["url", "dino"], ["rules", "dino"], ["created_at", "2021-01-25 21:09:44.363146"], ["updated_at", "2021-01-25 21:09:44.363146"]]

def set_community
  @community = Community.find(params[:id])
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]