app/controllers/comments_controller.rb

def create
  @comment = Comment.new comment_params
  @comment.acc_id = current_acc.id

respond_to do |format|
  format.js {
if @comment.save
  @comments = Comment.where(post_id: @comment.post_id)
---
INSERT INTO "comments" ("acc_id", "post_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["acc_id", 1], ["post_id", 1], ["message", "fsdfs"], ["created_at", "2021-01-26 20:29:31.015468"], ["updated_at", "2021-01-26 20:29:31.015468"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]