app/controllers/posts_controller.rb

  def new
    @community = Community.find(params[:community_id])
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new post_values
    @post.acc_id = current_acc.id
    @post.community_id = params[:community_id]

    if  @post.save
      redirect_to community_path(@post.community_id)
    else
      @community = Community.find(params[:community_id])
---
INSERT INTO "posts" ("acc_id", "community_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["acc_id", 2], ["community_id", 1], ["title", "post sa drugog akaunta"], ["body", "valjda radi"], ["created_at", "2021-01-26 22:18:32.735850"], ["updated_at", "2021-01-26 22:18:32.735850"]]
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def set_post
 @post = Post.includes(:comments).find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]

 def auth_subscriber
  unless Subscription.where(community_id: params[:community_id], acc_id: current_acc.id).any?
---
SELECT  1 AS one FROM "subscriptions" WHERE "subscriptions"."community_id" = $1 AND "subscriptions"."acc_id" = $2 LIMIT $3  [["community_id", 1], ["acc_id", 1], ["LIMIT", 1]]