app/controllers/public_controller.rb

SELECT  "communities".* FROM "communities" LIMIT $1  [["LIMIT", 5]]
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 20]]
---
def index
  @communities = Community.all.limit(5)
  @posts = Post.order(id: :desc).limit(20)

SELECT  "accs".* FROM "accs" WHERE "accs"."username" = $1 LIMIT $2  [["username", "potato"], ["LIMIT", 1]]
---
 def profile
  @profile = Acc.find_by_username params[:username]