app/controllers/subscriptions_controller.rb

INSERT INTO "subscriptions" ("acc_id", "community_id") VALUES ($1, $2) RETURNING "id"  [["acc_id", 1], ["community_id", 1]]
---
 def create
   @subscription = Subscription.new(subscription_paramas)
   @subscription.acc_id = current_acc.id
   @subscription.save